trade_exp/src/InformationRegisters/АнкетированиеОтветы/АнкетированиеОтветы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="643577fd-9487-4e88-8c72-f629d61be78a">
  <name>АнкетированиеОтветы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="baaf8d9e-d4a6-4963-8596-754959116e3a">
    <name>Ответ</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="e256b4bd-802d-49bb-b102-a8a503cdade3">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9b8e7ba-6e34-4fc4-ab59-9b811bce2b8e">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="450b72de-90b7-4737-bff9-c7f6bdd9000a">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="4718741d-63cc-449c-a76e-28dbde8626b3">
    <name>Респондент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="de8e365b-475f-42e3-a8ba-6e024fccc41c">
    <name>ШаблонАнкеты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a8389e52-1ac9-4fa5-b40a-4f0ef8acad3e">
    <name>Вопрос</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="95c1ddea-87da-4937-a9f2-da03fedf4b21">
    <name>НомерВарианта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="01ec4547-6443-416c-946b-51cf00035440">
    <name>ДатаЗаполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АнкетированиеОтветы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СформироватьТабличныйДокументОпроса(Респондент, Шаблон,ДатаЗаполнения, ТабДок) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АнкетированиеОтветы.Респондент,
	               |	АнкетированиеОтветы.ШаблонАнкеты,
	               |	АнкетированиеОтветы.Вопрос КАК Вопрос,
	               |	АнкетированиеОтветы.НомерВарианта КАК НомерВарианта,
	               |	АнкетированиеОтветы.Ответ,
	               |	АнкетированиеОтветы.ДатаЗаполнения как дата
	               |ИЗ
	               |	РегистрСведений.АнкетированиеОтветы КАК АнкетированиеОтветы
	               |ГДЕ
	               |	АнкетированиеОтветы.Респондент = &Респондент
	               |	И АнкетированиеОтветы.ШаблонАнкеты = &ШаблонАнкеты
	               |	И АнкетированиеОтветы.ДатаЗаполнения = &ДатаЗаполнения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вопрос,
	               |	НомерВарианта";
	Запрос.УстановитьПараметр("Респондент", Респондент);
	Запрос.УстановитьПараметр("ШаблонАнкеты", Шаблон);
	Запрос.УстановитьПараметр("ДатаЗаполнения", ДатаЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Макет = РегистрыСведений.АнкетированиеОтветы.ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Ответ = Макет.ПолучитьОбласть("Ответ");
	ДругойОтвет = Макет.ПолучитьОбласть("ДругойОтвет");
	ШапкаВыведена = Ложь;
	Вопрос = Справочники.ВопросыАнкетАльтерра.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		Если Не ШапкаВыведена Тогда
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка);
			ШапкаВыведена = Истина;
		КонецЕсли;
		Если Вопрос <> Выборка.Вопрос Тогда
			Ответ.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Ответ);
			Вопрос = Выборка.Вопрос;
		Иначе
			ДругойОтвет.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ДругойОтвет);
		КонецЕсли;
	КонецЦикла;
	ТабДок.Вывести(Макет.ПолучитьОбласть("Подвал"));
КонецПроцедуры
#КонецЕсли
